<template>
  <div>
    <h2>（一）基本经济指标</h2>
    <h3>1.地区生产总值</h3>
    <div style="border: 2px #1890ff dashed; margin: 15px 0px">
      <button @click="autoFill">填充数据</button>
      &emsp;&emsp;
      <button @click="clearData">清除数据</button>
      &emsp;&emsp;

      <span>省平均GDP:</span>
      <a-input-number
        v-model="provinceAvg"
        :parser="(value) => value.replace(/\$\s?|(,*)/g, '')"
        @change="onChange"
      />
      &emsp;&emsp;
      <span>全国平均GDP:</span>
      <a-input-number
        v-model="countryAvg"
        :parser="(value) => value.replace(/\$\s?|(,*)/g, '')"
        @change="onChange"
      />
    </div>
    <p ref="auto1">
      {{ auto1Arr[0] }}年恩施实现地区生产总值
      {{ auto1Arr[1] }}亿元，按可比价格计算，比上年增长
      {{ auto1Arr[2] }}%，增速在湖北省地级行政区位居第
      {{ auto1Arr[3] }}，低于/高于全省平均增速； 在全国地级行政区中位居第
      {{ auto1Arr[4] }}，低于/高于全国平均增速。全州人均地区生产总值
      <font color="red">
        {{ auto1Arr[5] }}
      </font>
      元，在湖北省地级行政区位居第
      {{ auto1Arr[6] }}
      ，
      <font color="red">
        {{ provinceLevel }}
      </font>

      全省平均水平，在全国地级行政区中位居第
      {{ auto1Arr[7] }}，
      <font color="red">
        {{ countryLevel }}
      </font>
      全国平均水平。 总体来看，恩施州目前经济发展水平
      <font color="red">
        {{ conclusion }}
      </font>
      。
    </p>
    <p>
      从过去十年的地区生产总值来看，恩施州经济总量规模持续扩大，地区生产总值和人均地区生产总值均表现出逐年上升的增长趋势。
      从增速来来看，地区生产总值的增速高于全省/全国平均水平，并保持稳定在高增长水平（但呈现出小幅度波动）；
      地区生产总值的增速高于同样全省/全国平均水平，并保持稳定在高增长水平（但呈现出小幅度波动）。
    </p>

    <h3>2.地区财政水平</h3>
    <p>
      2021年，恩施全州地方财政总收入168.75亿元，比上年增长17.8%。
      其中，地方一般公共预算收入75.51亿元，增长31.0%。税收收入56.91亿元，增长29.6%。
      全年一般公共预算支出376.49亿元，下降19.9%。财政自给率（一般公共预算收入/一般公共预算支出）为20.05%，
      财政自给率在湖北省地级行政区位居第___，低于/高于全省平均增速；在全国地级行政区中位居第___，
      低于/高于全国平均增速。
    </p>

    <h3>3.地区资产规模</h3>
    <p>
      2020年，恩施全州新增固定资产247164万元，比上年增长
      %。固定资产积累达到亿元； 规模以上固定资产原价为万元。
      全年固定资产投资比上年增长23.3%。
      分产业看，第一产业投资增长69.0%；第二产业投资增长15.6%；第三产业投资增长24.0%。
      实际利用外资万美元，比上年增长 %。
    </p>
    <a-textarea auto-size v-model="textarea1" />
    <h3>4.地区消费市场</h3>
    <p>
      2020年，社会消费品零售总额为5625925万元，居民消费水平为19710元，农村居民为13525元，城市居民为26909元，
      比上年分别增长 %、 %、 %。
      城镇常住居民人均可支配收入为30930元，生活消费支出为21898万元；农村常住居民人均可支配收入11887元，
      生活消费支出10061元，比上年分别增长 %、 %、 %。
      进出口总额为9435.70万美元，其中出口9375.5万美元，进60.2万美元，比上年分别增长
      %、 %、 %。
    </p>

    <h2>（二）产业结构变化</h2>
    <p>
      2021年，恩施州第一产业增加值224.51亿元，同比增长12.4%；
      第二产业增加值299.26亿元，同比增长13.1%；第三产业增加值778.60亿元，同比增长11.0%。
      三次产业结构比17.2:23.0:59.8。结合过去十年的产业结构变化情况来看，恩施州第二产业在经济中的占比较低，
      工业化进程滞后于湖北省和全国平均水平（第二产业比重低于全省/全国平均比重）。
    </p>
    <p>img ...</p>
    <p>
      全年规模以上工业中，农副食品加工业增加值比上年增长28.9%，酒、饮料和精制茶制造业增长13.0%，
      医药制造业增长87.6%，非金属矿物制品业增长22.0%，计算机、通信和其他电子设备制造业增长46.7%，
      电力、热力生产和供应业增长5.2%。
    </p>

    <p>
      全年批发和零售业增加值89.38亿元，比上年增长12.1%；
      交通运输、仓储和邮政业增加值39.64亿元，增长15.5%；住宿和餐饮业增加值40.41亿元，增长23.0%；
      金融业增加值69.06亿元，增长3.0%；房地产业增加值138.17亿元，增长8.6%；信息传输、
      软件和信息技术服务业增加值32.05亿元，增长23.0%。
    </p>

    <h2>（三）重点产业平台</h2>
    <h3>1.恩施高新区技术产业园区</h3>
    <p>
      <strong>发展历程：</strong>
      2017年10月18日，省人民政府批复同意设立恩施州高新技术产业园区，享受省级高新技术产业园区的相关政策。2018年1月18日，高新区与恩施市人民政府签订托管协议，正式托管六角亭街道办事处全境，面积约81.77平方公里；舞阳坝街道办事处金子坝村11.66平方公里维持原托管方式。2018年1月21日，中共恩施州高新技术产业园区工作委员会、恩施州高新技术产业园区管理委员会正式挂牌。
    </p>

    <p>
      <strong>发展定位：</strong>
      高新区将坚持生态发展、特色开发、绿色繁荣发展，着力推进国家高新区的战略引领和创新示范作用，
      打造具有国际影响力的“恩施·中国硒谷”，建设“生态型、科技型、创新型”产业园区。
      建设中国富硒产业发展引领区，立足恩施富硒资源优势和技术积累，在富硒食品、绿色用品等方面加快新技术、
      新产品研制开发，构建完整的富硒产业链，打造具有国际影响力的中国富硒产业发展引领区。
    </p>

    <p>
      <strong>发展目标与主导产业：</strong>
      按照州委、州政府确定的“一年打牢基础，两年出形象，三年建成国家级高新区”总体目标，着力打造硒食品精深加工、生物医药、电子信息和现代物流四大产业集群。
    </p>

    <p>
      <strong>空间布局：</strong>
      目前，恩施州高新技术产业园区按照“一城一心、两区四园六廊”（一城，即施州古城；一心，
      即月亮岩科技研发中心；两区，即望城坡－高桥坝生态康养区、谭家坝科教区；四园，即生物医药产业园、
      硒产业园、电子信息产业园、高新南综合产业园；六廊，即高旗大道生态廊道、高桥河生态廊道、月亮岩生态廊道、
      四道河－安来高速生态廊道、巴公溪生态廊道、清江生态廊道）的功能分区进行规划结构布局。
    </p>
  </div>
</template>

<script>
export default {
  data() {
    return {
      txt: "",
      countryAvg: 38011,
      provinceAvg: 38011,
      auto1Arr: [],
    };
  },
  methods: {
    autoFill() {
      this.auto1Arr = [
        "2021",
        "1302.36",
        "10",
        "15",
        "150",
        "38011",
        "15",
        "15",
        "15",
      ];
    },
    clearData() {
      this.auto1Arr = [];
    },
    show() {
      console.log(this.$refs.fill1.innerHTML);
    },
    onChange(value) {
      console.log("changed", value);
    },
  },
  computed: {
    countryLevel() {
      if (!this.auto1Arr[5]) {
        return "";
      }
      return this.auto1Arr[5] >= Number(this.countryAvg) ? "高于" : "低于";
    },
    provinceLevel() {
      if (!this.auto1Arr[5]) {
        return "";
      }
      return this.auto1Arr[5] >= Number(this.provinceAvg) ? "高于" : "低于";
    },
    conclusion() {
      if (!this.auto1Arr[5]) {
        return "";
      }
      if (this.countryLevel === "高于" && this.provinceLevel === "高于") {
        return "超过平均水平";
      } else if (this.countryLevel !== this.provinceLevel) {
        return "一般";
      } else {
        return "相对落后";
      }
    },
  },
};
</script>

<style>
</style>