<template>
  <div>
    <h1>规划编制背景</h1>
    <p>
      恩施土家族苗族自治州为湖北省辖自治州，首府驻恩施市，下辖恩施、利川、建始、巴东、宣恩、咸丰、来凤、鹤峰8个县市，全州面积2.4万平方千米。2020年，年末总人口为402.22万，其中常住人口为345万人。全州2021年末户籍人口401.13万人，其中，男性208.83万人，占总人口的52.1％；女性192.30万人，占总人口的47.9％。全州外出农民工94.87万人，其中，省内乡外就业33.77万人，省外就业61.10万人。全州城镇化率达58.3%
      低于全国2020年63.9%的平均水平。
    </p>
    <p>
      恩施州以山地为主，平均海拔高度1000米，海拔1200米以上的地区占总面积的29.4％，海拔800—1200米的地区占总面积的43.6％，海拔800米以下的地区占总面积的27％。恩施州属亚热带季风性山地湿润气候。冬少严寒，夏无酷暑，雨量充沛，四季分明；海拔落差大，小气候特征明显，垂直差异突出，"一山有四季，十里不同天"。境内年均气温16.2℃，年平均降水量1600毫米。地处武汉和重庆两大"火炉"之间，是最适宜人类居住的地区之一。恩施州森林覆盖率近70%，享有“鄂西林海”、“华中药库”、“烟草王国”、“世界硒都”之称号。
    </p>
    <p>
      2021年，恩施全州地区生产总值1302.36亿元，同比增长11.7%。全州人均地区生产总值38011元。其中：第一产业增加值224.51亿元，同比增长12.4%；第二产业增加值299.26亿元，同比增长13.1%；第三产业增加值778.60亿元，同比增长11.0%。三次产业结构比为17.2:23.0:59.8。全州人均地区生产总38011元。
    </p>
    <p>
      近年来，湖北省省委十一届八次全会明确提出推动“宜荆荆恩”城市群由点轴式向扇面式发展，支持“宜荆荆恩”城市群打造以绿色经济和战略性新兴产业为特色的高质量发展经济带。恩施土家族苗族自治州委七届十一次全体会议提出，恩施州牢固树立“绿水青山就是金山银山”发展理念，立足大生态，构建大交通，发展大旅游，打造大产业，做好土、硒、茶、凉、绿“五字”文章，围绕民族风情、富硒资源、优质茶叶、旅游康养、绿色生态五大特色优势，加快构建以现代农业、生态文化旅游业、绿色能源、新型工业为主体的绿色产业体系，真正让恩施的绿色生态成为一大特色、一个品牌、一座富矿，奋力推进恩施绿色崛起。
    </p>
  </div>
</template>

<script>
export default {

}
</script>

<style>
</style>