<template>
  <div>
    <div style="float: right">
      <a-button type="primary" @click="changeEdit">
        <a-icon type="book" />
        /
        <a-icon type="form" />
      </a-button>
    </div>
    <div v-show="isEdit" ref="content">
      <h1>一、规划背景</h1>
      <h2>（一）规划区域介绍：</h2>
      <p>
        恩施土家族苗族自治州为湖北省辖自治州，首府驻恩施市，下辖恩施、利川、建始、巴东、宣恩、咸丰、来凤、鹤峰8个县市，
        全州面积2.4万平方千米。2020年，年末总人口为402.22万，其中常住人口为345万人。全州2021年末户籍人口401.13万人，
        其中，男性208.83万人，占总人口的52.1％；女性192.30万人，占总人口的47.9％。全州外出农民工94.87万人，
        其中，省内乡外就业33.77万人，省外就业61.10万人。全州城镇化率达58.3%，低于全国2020年63.9%的平均水平。
      </p>
      <p>
        恩施州以山地为主，平均海拔高度1000米，海拔1200米以上的地区占总面积的29.4％，海拔800—1200米的地区占总面积的43.6％，
        海拔800米以下的地区占总面积的27％。恩施州属亚热带季风性山地湿润气候。冬少严寒，夏无酷暑，雨量充沛，四季分明；海拔落差大，
        小气候特征明显，垂直差异突出，"一山有四季，十里不同天"。境内年均气温16.2℃，年平均降水量1600毫米。
        地处武汉和重庆两大"火炉"之间，是最适宜人类居住的地区之一。
        恩施州森林覆盖率近70%，享有“鄂西林海”、“华中药库”、“烟草王国”、“世界硒都”之称号。
      </p>
      <p>
        2021年，恩施全州地区生产总值1302.36亿元，同比增长11.7%。全州人均地区生产总值38011元。
        其中：第一产业增加值224.51亿元，同比增长12.4%；第二产业增加值299.26亿元，同比增长13.1%；
        第三产业增加值778.60亿元，同比增长11.0%。三次产业结构比为17.2:23.0:59.8。全州人均地区生产总38011元。
      </p>
      <h2>（二）重要发展思路</h2>
      <p>
        近年来，湖北省省委十一届八次全会明确提出推动“宜荆荆恩”城市群由点轴式向扇面式发展，
        支持“宜荆荆恩”城市群打造以绿色经济和战略性新兴产业为特色的高质量发展经济带。
        恩施土家族苗族自治州委七届十一次全体会议提出，恩施州牢固树立“绿水青山就是金山银山”发展理念，
        立足大生态，构建大交通，发展大旅游，打造大产业，做好土、硒、茶、凉、绿“五字”文章，围绕民族风情、
        富硒资源、优质茶叶、旅游康养、绿色生态五大特色优势，加快构建以现代农业、生态文化旅游业、绿色能源、
        新型工业为主体的绿色产业体系，真正让恩施的绿色生态成为一大特色、一个品牌、一座富矿，奋力推进恩施绿色崛起。
      </p>
      <h2>（三）上位规划与相关政策</h2>
      <p>
        湖北省2021年4月出台《湖北省国民经济和社会发展第十四个五年规划和2035远景目标纲要》，
        其中指出要建设“宜荆荆恩”城市群：……支持恩施州建设世界硒都·中国硒谷，打造“两山”实践创新基地、
        全国优质康养基地，创建国家级承接产业转移示范区、国家全域旅游示范区、全国民族团结进步示范区。
        要推动“宜荆荆恩”城市群落实长江经济带发展战略，打造全省高质量发展南部列阵，建设成为联结长江中游城市群
        和成渝地区双城经济圈的重要纽带。依托长江、清江、江汉运河等轴线，促进毗邻地区一体化发展，开展跨江合作，
        推动重点地区组团发展。依托长江综合交通立体走廊，加快建设城际快速通道，健全水运网络，打造多式联运示范，
        形成区域高效交通圈。以绿色经济和战略性新兴产业为特色，协同打造以绿色化工、生物医药、高端装备、
        食品为特色的产业集群。打好三峡、楚文化、民族文化“三张牌”，推进区域生态文化旅游协作联动，打造休闲度假胜地。
        加快长江、清江生态廊道建设，统筹生态空间协同保护。
      </p>
      <h2>（四）宏观发展环境</h2>
      <p>
        国际力量对比深刻调整，我国国际影响力、感召力、塑造力明显增强，有利于恩施州加快“走出去”参与全球价值链和市场布局，
        同时也面临对外贸易、跨境投资、国际合作等不确定性增加的挑战。新一轮科技革命和产业变革深入发展，
        我国大力推进科技创新催生新发展动能，有利于恩施州充分发挥产业基础和创新资源优势，
        加快发展以“数字经济”为代表的新兴产业，补齐具有战略性、全局性的核心产业链，打造恩施州产业竞争新优势，
        同时也面临科技创新支撑不足、核心技术“卡脖子”等挑战。
      </p>
      <p>
        我国加快构建新发展格局，有利于恩施州发挥承东启西、连接南北的区位优势，在畅通产业循环、市场循环、经济社会循环中发挥更大作用，
        同时也面临国内区域板块竞争更加激烈的挑战。恩施州经济实力、科技实力不断增强，更有能力、
        更有条件应对各类风险挑战和解决突出问题，同时，发展不平衡不充分仍然是恩施州最大的实际，创新驱动能力不够强，
        开放型经济发展水平不够高，城乡区域发展不够协调，生态环境改善任重道远，民生保障还存在短板，社会治理还有弱项，
        疫后重振和高质量发展面临较多困难。
      </p>
      <p>
        总体而言，“十四五”时期，恩施州处于战略机遇叠加期、政策红利释放期、发展布局优化期、蓄积势能迸发期、省域治理提升期，
        机遇大于挑战，前景十分广阔。党中央支持恩施一揽子政策提供强力支撑，伟大抗疫精神正转化为推动发展的强大动力，
        全州上下要立足“两个大局”，深刻认识全州发展环境面临的新变化，增强机遇意识和风险意识，充分发挥恩施优势，
        抢时间、抢机遇、抢要素，准确识变、科学应变、主动求变，保持战略定力，扎实办好自己的事，
        以自身发展的确定性应对外部环境的不确定性，努力在危机中育先机、于变局中开新局。
      </p>
    </div>

    <div v-show="!isEdit" v-for="data in arr" :key="data.id">
      <TxtEdit
        :textObj="data"
        @editText="editText"
        @addText="addText"
        @deleteText="deleteText"
        :id="data.id"
      />
    </div>
  </div>
</template>

<script>
import { obj, findIdx } from "../data";
import TxtEdit from "@/components/TxtEdit.vue";
import { nanoid } from "nanoid";
var curKey = "1-1";
export default {
  props: ["papers"],
  components: {
    TxtEdit,
  },
  data() {
    return {
      ...obj(), // 初始化赋值为0
      isEdit: false,
      arr: this.papers[curKey] || [],
    };
  },
  created() {},
  mounted() {
    if (this.arr == false) {
      this.fillParagraphText();
    }
  },
  methods: {
    init() {
      // 可参考ch2se1的初始化
    },
    changeEdit() {
      this.isEdit = !this.isEdit;
    },
    fillParagraphText() {
      // 将获取了数据库数据的页面上的文本添加到arr数组中
      let nodes = this.$refs.content.childNodes;
      for (let node of nodes) {
        this.arr.push({
          [node.tagName]: node.innerText,
          id: nanoid(),
        });
      }
    },
    editText(id, obj) {
      this.arr[findIdx(this.arr, id)] = obj;
      this.save();
    },
    deleteText(id) {
      this.arr.splice(findIdx(this.arr, id), 1);
      this.save();
      // this.$router.go(0);
    },
    addText(id, textValue) {
      this.arr.splice(findIdx(this.arr, id) + 1, 0, {
        P: textValue,
        id: nanoid(),
      });
      this.save();
      // this.$router.go(0);
    },
    save() {
      this.$bus.$emit("updatePapers", curKey, this.arr);
    },
  },
  beforeDestroy() {
    this.save();
  },
};
</script>

<style></style>
