<template>
  <div>
    <p>
      模板一：吉林省产业结构转型升级报告2003 年 10月，
      中共中央、国务院正式印发《关于实施东北地区等老工业基地振兴战略的若干意见》，
      制定了振兴战略的各项方针政策，吹响了振兴东北老工业基地的号角。
      12月，国务院振兴东北地区等老工业基地领导小组成立。
      此后，中央先后在东北地区实行了一系列促进振兴的战略与政策。
      例如，2007年出台《东北地区振兴“十一五”规划》、
      2009年出台《国务院关于进一步实施东北地区等老工业基地振兴战略的若干意见》、
      2012 年出台《东北振兴“十二五”规划》、 2014
      年出台《“关于近期支持东北振兴若干重大政策举措的意见”》、2016 年 4
      月出台《中共中央 国务院关于全面振兴东北地区等老工业基地的若干意见》，2016
      年 11
      月出台《关于深入推进实施新一轮东北振兴战略加快推动东北地区经济企稳向好若干重要举措的意见》、
      2016 年低出台《东北振兴“十三五”规划》。 2017 年 3
      月国务院出台《东北地区与东部地区部分省市对口合作工作方案》。
    </p>
    <a-textarea auto-size v-model="t1" />
    <!-- $paperArr.ch1.t1[1] -->
  </div>
</template>

<script>
export default {
  data() {
    let t1;
    let textData = this.$paper.ch1.se3;
    if (typeof textData === "undefined") {
      t1 = "";
    } else {
      t1 = textData.txts.t1;
    }
    return {
      t1,
    };
  },
  beforeDestroy() {
    this.$paper.ch1.se3 = {
      txts: {
        t1: this.t1,
      },
    };
  },
};
</script>


<style>
</style>